h_step = 50  # шаг горизонтальныйх линий подвала

p = 304.00  # координата "Х" для старта рисок расстояний отметок в подвале профиля

tip = [1, 2]

# координаты текста для шапки профиля трубы
coordinates_text_basement_pipe = [[61.21, 381.63],
                                  [109.57, 362.79], [40.01, 330.54],
                                  [108.31, 309.99], [33.89, 270.16],
                                  [94.81, 231.78], [47.29, 210.97],
                                  [112.15, 168.63], [6.45, 110.89],
                                  [188.99, 128.31], [116.18, 68.49], [153.10, 21.65]]

# координаты текста для шапки профиля подушки
coordinates_text_basement_pillow = [[39.41, 378.69], [105.21, 359.85],
                                    [61.294, 330.54], [81.91, 309.99],
                                    [39.66, 280.54], [81.72, 259.99],
                                    [12.02, 219.802], [94.810, 181.780],
                                    [47.290, 160.970], [111.82, 118.630],
                                    [116.180, 69.180], [153.100, 18.740]]

# координаты текста для шапки профиля обсыпки
coordinates_text_basement_filling = [[61.42, 378.99], [91.78, 360.15],
                                     [39.72, 330.54], [92.11, 309.99],
                                     [39.72, 280.54], [107.83, 259.99],
                                     [119.79, 230.54], [118.88, 209.99],
                                     [94.81, 181.78], [50.32, 160.97],
                                     [112.16, 118.63], [116.18, 69.18],
                                     [153.10, 18.7]]

# координаты текста для шапки профиля траншеи
coordinates_text_basement_transh = [[83.66, 418.58], [61.21, 381.63],
                                    [104.80, 362.79], [39.11, 330.54],
                                    [104.79, 309.99], [33.89, 270.16],
                                    [62.96, 221.11], [94.81, 181.78],
                                    [47.29, 160.97], [111.77, 118.63],
                                    [116.18, 69.18], [153.10, 18.74]]

# текст для шапки профиля трубы
text_basement_pipe = ['Проектные отметки', 'верха трубы, м',
                      'Фактические отметки', 'верха трубы, м',
                      'Разница в отметках, м',
                      'Откос', 'Ширина дна траншеи',
                      'Тип прокладки',
                      'Длина', 'Уклон',
                      'Расстояние, м',
                      'Пикеты, м']

# текст для шапки профиля траншеи
text_basement_transh = ['Отметки земли, м',
                        'Проектные отметки', 'дна траншеи, м',
                        'Фактические отметки', 'дна траншеи, м',
                        'Разница в отметках, м',
                        'Глубина траншеи, м',
                        'Откос', 'Ширина дна траншеи',
                        'Тип прокладки',
                        'Расстояние, м',
                        'Пикеты, м']

# текст для шапки профиля подушки
text_basement_pillow = ['Фактические отметки', 'дна траншеи, м',
                        'Проектные отметки', 'верха подсыпки, м',
                        'Фактические отметки', 'верха подсыпки, м',
                        'Толщина слоя подсыпки, м',
                        'Откос', 'Ширина дна траншеи',
                        'Тип прокладки',
                        'Расстояние, м',
                        'Пикеты, м']

# текст для шапки профиля обсыпки
text_basement_filling = ['Проектные отметки', 'верха обсыпки, м',
                         'Фактические отметки', 'верха обсыпки, м',
                         'Фактические отметки', 'верха трубы, м',
                         'Толщина слоя', 'над трубой, м',
                         'Откос', 'Ширина дна траншеи',
                         'Тип прокладки',
                         'Расстояние, м',
                         'Пикеты, м']
